Revit 2027 API
Connector.AllRefs Property
All references of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorSet AllRefs { get; }
Public ReadOnly Property AllRefs As ConnectorSet
	Get
public:
property ConnectorSet^ AllRefs {
	ConnectorSet^ get ();
}
member AllRefs : ConnectorSet with get
Property Value
ConnectorSet
Remarks
A set of connectors that the connectors is connected to, including both physical connection and logical connection.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace